<?
function upload_image($input_name,$file_name)
{
    //Функция подгрузки изображений из элемента
    //управления "файл"
    // <input type="file"/>
    //---------------------------АРГУМЕНТЫ:----------------------------
    // $input_name - значение атрибута name элемента
    //управления "файл".
    // <input type="file" name="$input_name"/>
    // $file_name - имя, под которым файл будет
    //сохранен на сервере (без расширения).
    // --------------------------ВОЗВРАЩАЕМНОЕ ЗНАЧЕНИЕ:---------------
    //Расширение файла или пустая строка в случае ошибки
    //---------------------------КОНФИГУРАЦИЯ:-------------------------
    //Списаок расширений файлов, разрешённых к загрузке
    $allowed_ext=Array("png","jpg","gif","bmp");
    //Пусть к каталогу, куда должны быть загружены файлы.
    $image_path="$_SERVER[DOCUMENT_POOT]/mysite/images";
    //=================================================================
    //Доступ к загруженному файлу осуществляется
    //через супеглобальный массив $_FILES
    // $_FILES["myfile"]["mane"] - имя файла, какое оно было на 
    //компьютере посетителся сайта.
    // $_FILES["myfile"]["error"] - код ошибки,
    //в случае если она произошла. 
    // $_FILES["myfile"]["tmp_name"] - полный путь к 
    //загруженному файлу во временной папке
    //(все загруженные файлы попадают во временную папку
    //обычно это каталог /tmp).
    //Проверяем, не было ли ошибок при загрузке файла
    if($_FILES[$input_name]["error"]==UPLOAD_ERR_OK)
    {
        //В целях безопасности проверяем, что файл
        //был действительно загружен из формы
        if(is_uploaded_file($_FILES[$input_name]['tmp_name']))
        {
            //выделяем из имени файла расширения
            $ext = substr($_FILES[$input_name]['name'],
            1 + strrpos($_FILES[$input_name]['name'],"."));
            //и проверяем, что оно является допустимы
            //(расширением имеено графического файла). 
            if(in_array(strtolower($ext),$allowed_ext))
            {
                //перемещаем файл из 
                //временной папки в постоянную
                @move_uploaded_file(
                $_FILES[$input_name]['tmp_name'],
                $image_path."/".$file_name.".".$ext);
                //Возврат расширения
                return $ext;
            }
        }
    }
    //Ошибка - возврат пустой строки
    return "";
}
?>